tap "romkatv/powerlevel10k"
brew "curl"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "htop"
brew "httpie"
brew "jq"
brew "nvm"
brew "powerlevel10k"
brew "pyenv"
brew "pyenv-virtualenv"
brew "tree"
brew "unzip"
brew "wget"
cask "docker-desktop"
cask "iterm2"
