tap "romkatv/powerlevel10k"
brew "act"
brew "curl"
brew "fzf"
brew "gh"
brew "git"
brew "gnu-sed"
brew "helm"
brew "htop"
brew "httpie"
brew "jq"
brew "k9s"
brew "kubernetes-cli"
brew "nvm"
brew "opentofu"
brew "pipx"
brew "powerlevel10k"
brew "pyenv"
brew "pyenv-virtualenv"
brew "stern"
brew "terraform"
brew "tree"
brew "unzip"
brew "wget"
brew "yq"
cask "docker-desktop"
cask "iterm2"
cask "jetbrains-toolbox"
cask "postman"
cask "visual-studio-code"
vscode "42crunch.vscode-openapi"
vscode "bradlc.vscode-tailwindcss"
vscode "confluentinc.vscode-confluent"
vscode "databricks.databricks"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "humao.rest-client"
vscode "jeppeandersen.vscode-kafka"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vmware.vscode-spring-boot"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscjava.vscode-spring-boot-dashboard"
vscode "vscjava.vscode-spring-initializr"
